{
  "test": [
    {
      "one": 1,
      "id": 15
    }
  ],
  "contacts": [
    {
      "name": "Obo Marly",
      "number": "123-23-77",
      "id": 1
    },
    {
      "name": "Garly Quine",
      "number": "665-14-26",
      "id": 2
    },
    {
      "name": "Chaply Charlin",
      "number": "545-24-98",
      "id": 3
    },
    {
      "name": "Gooro Bum",
      "number": "444-22-33",
      "id": 4
    },
    {
      "name": "toDelete",
      "number": "123556",
      "id": 5
    }
  ],
  "books": [
    {
      "id": 1,
      "name": "It",
      "description": "It is a 1986 horror novel by American author Stephen King. It was his 22nd book and his 17th novel written under his own name. The story follows the experiences of seven children as they are terrorized by an evil entity that exploits the fears of its victims to disguise itself while hunting its prey. 'It' primarily appears in the form of Pennywise the Dancing Clown to attract its preferred prey of young children.",
      "imgUrl": "https://upload.wikimedia.org/wikipedia/en/7/78/It_%28Stephen_King_novel_-_cover_art%29.jpg",
      "authorId": 1
    },
    {
      "id": 2,
      "name": "The Outsider",
      "description": "An unspeakable crime. A confounding investigation. At a time when the King brand has never been stronger, he has delivered one of his most unsettling and compulsively readable stories.",
      "imgUrl": "https://upload.wikimedia.org/wikipedia/en/e/e4/The_Outsider_by_Stephen_King.jpg",
      "authorId": 1
    },
    {
      "id": 3,
      "name": "The Adventures of Sherlock Holmes",
      "description": "The Adventures of Sherlock Holmes is the series of short stories that made the fortunes of the Strand magazine, in which they were first published, and won immense popularity for Sherlock Holmes and Dr Watson. The detective is at the height of his powers and the volume is full of famous cases, including 'The Red-Headed League', 'The Blue Carbuncle', and 'The Speckled Band'",
      "imgUrl": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Adventures_of_sherlock_holmes.jpg",
      "authorId": 2
    },
    {
      "id": 4,
      "name": "The Lost World",
      "description": "It's London, 1907. Journalist Edward Malone, rejected by the woman he loves because he is too prosaic, decides to go in search of adventure and fame to prove himself worthy of her. Soon after, he meets Professor George Challenger, a scientist who claims to have discovered a 'lost world' populated by pterodactyls and other prehistoric monsters.",
      "imgUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Cover_%28The_Lost_World%2C_1912%29.jpg/800px-Cover_%28The_Lost_World%2C_1912%29.jpg",
      "authorId": 2
    },
    {
      "id": 5,
      "name": "The Hobbit",
      "description": "In a hole in the ground there lived a hobbit. Not a nasty, dirty, wet hole, filled with the ends of worms and an oozy smell, nor yet a dry, bare, sandy hole with nothing in it to sit down on or to eat: it was a hobbit-hole, and that means comfort.",
      "imgUrl": "https://images-na.ssl-images-amazon.com/images/I/91b0C2YNSrL.jpg",
      "authorId": 3
    },
    {
      "id": 6,
      "name": "The Lord of the Rings",
      "description": "One Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkness bind them. In ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, the Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth",
      "imgUrl": "https://upload.wikimedia.org/wikipedia/ru/8/82/%D0%91%D1%80%D0%B0%D1%82%D1%81%D1%82%D0%B2%D0%BE_%D0%9A%D0%BE%D0%BB%D1%8C%D1%86%D0%B0.gif",
      "authorId": 3
    },
    {
      "id": 7,
      "name": "The Old Man and the Sea",
      "description": "This short novel, already a modern classic, is the superbly told, tragic story of a Cuban fisherman in the Gulf Stream and the giant Marlin he kills and loses—specifically referred to in the citation accompanying the author's Nobel Prize for literature in 1954. ",
      "imgUrl": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1630572642l/2165._SY475_.jpg",
      "authorId": 4
    },
    {
      "id": 8,
      "name": "A Farewell to Arms",
      "description": "A Farewell to Arms is the unforgettable story of an American ambulance driver on the Italian front and his passion for a beautiful English nurse. Set against the looming horrors of the battlefield - the weary, demoralized men marching in the rain during the German attack on Caporetto; ",
      "imgUrl": "https://upload.wikimedia.org/wikipedia/ru/1/13/Farewell_to_arms.jpg",
      "authorId": 4
    },
    {
      "id": 9,
      "name": "The Adventures of Huckleberry Finn",
      "description": "A nineteenth-century boy from a Mississippi River town recounts his adventures as he travels down the river with a runaway slave, encountering a family involved in a feud, two scoundrels pretending to be royalty, and Tom Sawyer's aunt who mistakes him for Tom.",
      "imgUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Huckleberry_Finn_book.JPG/800px-Huckleberry_Finn_book.JPG",
      "authorId": 5
    },
    {
      "id": 10,
      "name": "The Adventures of Tom Sawyer",
      "description": "The Adventures of Tom Sawyer revolves around the youthful adventures of the novel's schoolboy protagonist, Thomas Sawyer, whose reputation precedes him for causing mischief and strife. Tom lives with his Aunt Polly, half-brother Sid, and cousin Mary in the quaint town of St. Petersburg, just off the shore of the Mississippi River.",
      "imgUrl": "https://kbimages1-a.akamaihd.net/1dce3b26-c3b4-440c-aede-458e01da4142/1200/1200/False/the-adventures-of-tom-sawyer-149.jpg",
      "authorId": 5
    }
  ],
  "authors": [
    {
      "id": 1,
      "name": "Stephen King"
    },
    {
      "id": 2,
      "name": "Arthur Conan Doyle"
    },
    {
      "id": 3,
      "name": "John Tolkien"
    },
    {
      "id": 4,
      "name": "Ernest Hemingway"
    },
    {
      "id": 5,
      "name": "Mark Twain"
    }
  ],
  "todos": [
    {
      "title": "11111",
      "completed": false,
      "id": 1
    },
    {
      "title": "222222",
      "completed": false,
      "id": 2
    },
    {
      "title": "33333",
      "completed": false,
      "id": 3
    },
    {
      "title": "444444",
      "completed": false,
      "id": 4
    },
    {
      "title": "55555",
      "completed": true,
      "id": 5
    }
  ]
}